ERM/src/DataProcessors/DraftPenaltiesVisualization/DraftPenaltiesVisualization.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>DraftPenaltiesVisualization</name>
</mdclass:DataProcessor>

ERM/src/InformationRegisters/Penalties/Penalties.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Penalties</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>USDAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>DueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BaseAmountUSD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>OverdueDays</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Percent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Client</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ClientID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>LegalEntity</name>
    <type>
      <types>CatalogRef.LegalEntiites</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Source</name>
    <type>
      <types>EnumRef.ТипыСоответствий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Invoice</name>
    <type>
      <types>DocumentRef.Invoice</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PenaltyType</name>
    <type>
      <types>EnumRef.PenaltyTypes</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PenaltyDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>PaymentDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERM/src/InformationRegisters/ИерархияКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ИерархияКонтрагентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/AccumulationRegisters/BilledAR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>BilledAR</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Amount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>BaseAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Client</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Source</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСоответствий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Location</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SubSubSegment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сегменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Invoice</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Invoice</v8:Type>
						<v8:Type>cfg:DocumentRef.Memo</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Account</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Lawson</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Oracle</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Currency</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>AU</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ERM/src/InformationRegisters/ВнутренниеКурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеКурсыВалют</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Enums/PenaltyTypes/PenaltyTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>PenaltyTypes</name>
  <enumValues>
    <name>Penalty</name>
  </enumValues>
  <enumValues>
    <name>Benefit</name>
  </enumValues>
  <enumValues>
    <name>OnTime</name>
  </enumValues>
</mdclass:Enum>

ERM/src/DataProcessors/DraftPenaltiesVisualization/Forms/Форма/Module.bsl
&НаСервере
Процедура РасчитатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Penalties.Client КАК Client,
		|	Penalties.Contract КАК Contract,
		|	Penalties.Invoice КАК Invoice,
		|	Penalties.PenaltyType КАК PenaltyType,
		|	Penalties.Amount КАК Amount,
		|	Penalties.USDAmount КАК USDAmount,
		|	Penalties.DueDate КАК DueDate,
		|	Penalties.BaseAmount КАК BaseAmount,
		|	Penalties.BaseAmountUSD КАК BaseAmountUSD,
		|	Penalties.OverdueDays КАК OverdueDays,
		|	Penalties.Percent КАК Percent,
		|	ИерархияКонтрагентовСрезПоследних.ГоловнойКонтрагент КАК ParentClient,
		|	Penalties.PaymentDate КАК PaymentDate
		|ПОМЕСТИТЬ ВТ_ИсходныеДанные
		|ИЗ
		|	РегистрСведений.Penalties КАК Penalties
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ИерархияКонтрагентов.СрезПоследних КАК ИерархияКонтрагентовСрезПоследних
		|		ПО Penalties.Client = ИерархияКонтрагентовСрезПоследних.Контрагент
		|ГДЕ
		|	Penalties.Период >= &ПериодНачало
		|	И Penalties.Период <= &ПериодКонец
		|	&УсловиеParentКлиент
		|	&УсловиеКлиент
		|	&УсловиеКонтракт
		|	И Penalties.Активность
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ BilledARОстатки.Invoice) КАК КоличествоInvoice,
		|	СУММА(BilledARОстатки.AmountОстаток) КАК AmountОстаток,
		|	СУММА(ВЫБОР
		|			КОГДА ВнутренниеКурсыВалютСрезПоследних.Курс ЕСТЬ NULL
		|					ИЛИ ВнутренниеКурсыВалютСрезПоследних.Курс = 0
		|				ТОГДА 0
		|			ИНАЧЕ BilledARОстатки.AmountОстаток / ВнутренниеКурсыВалютСрезПоследних.Курс
		|		КОНЕЦ) КАК BaseAmountОстаток
		|ИЗ
		|	РегистрНакопления.BilledAR.Остатки(&ПериодКонец, ) КАК BilledARОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренниеКурсыВалют.СрезПоследних(&ПериодКонец, ) КАК ВнутренниеКурсыВалютСрезПоследних
		|		ПО BilledARОстатки.Currency = ВнутренниеКурсыВалютСрезПоследних.Валюта
		|ГДЕ
		|	BilledARОстатки.Invoice.DueDateTo > &ПериодКонец
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ИсходныеДанные.Invoice) КАК КоличествоInvoice,
		|	СУММА(ВТ_ИсходныеДанные.BaseAmountUSD) КАК BaseAmountUSD
		|ИЗ
		|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
		|ГДЕ
		|	ВТ_ИсходныеДанные.PenaltyType = ЗНАЧЕНИЕ(Перечисление.PenaltyTypes.OnTime)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсходныеДанные.Invoice КАК Invoice,
		|	СУММА(ВТ_ИсходныеДанные.USDAmount) КАК USDAmount,
		|	МАКСИМУМ(ВТ_ИсходныеДанные.BaseAmountUSD) КАК BaseAmountUSD
		|ПОМЕСТИТЬ ВТ_BenefitГруппировка
		|ИЗ
		|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
		|ГДЕ
		|	ВТ_ИсходныеДанные.PenaltyType = ЗНАЧЕНИЕ(Перечисление.PenaltyTypes.Benefit)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИсходныеДанные.Invoice
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_BenefitГруппировка.Invoice) КАК КоличествоInvoice,
		|	СУММА(ВТ_BenefitГруппировка.USDAmount) КАК USDAmount,
		|	СУММА(ВТ_BenefitГруппировка.BaseAmountUSD) КАК BaseAmountUSD
		|ИЗ
		|	ВТ_BenefitГруппировка КАК ВТ_BenefitГруппировка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсходныеДанные.Invoice КАК Invoice,
		|	СУММА(ВТ_ИсходныеДанные.USDAmount) КАК USDAmount,
		|	МАКСИМУМ(ВТ_ИсходныеДанные.BaseAmountUSD) КАК BaseAmountUSD,
		|	МАКСИМУМ(ВТ_ИсходныеДанные.PaymentDate) КАК PaymentDate
		|ПОМЕСТИТЬ ВТ_PenaltyГруппировка
		|ИЗ
		|	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
		|ГДЕ
		|	ВТ_ИсходныеДанные.PenaltyType = ЗНАЧЕНИЕ(Перечисление.PenaltyTypes.Penalty)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИсходныеДанные.Invoice
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_PenaltyГруппировка.Invoice) КАК КоличествоInvoice,
		|	СУММА(ВТ_PenaltyГруппировка.USDAmount) КАК USDAmount,
		|	СУММА(ВТ_PenaltyГруппировка.BaseAmountUSD) КАК BaseAmountUSD
		|ИЗ
		|	ВТ_PenaltyГруппировка КАК ВТ_PenaltyГруппировка
		|ГДЕ
		|	ВТ_PenaltyГруппировка.PaymentDate = ДАТАВРЕМЯ(1, 1, 1)
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_PenaltyГруппировка.Invoice) > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_PenaltyГруппировка.Invoice) КАК КоличествоInvoice,
		|	СУММА(ВТ_PenaltyГруппировка.USDAmount) КАК USDAmount,
		|	СУММА(ВТ_PenaltyГруппировка.BaseAmountUSD) КАК BaseAmountUSD
		|ИЗ
		|	ВТ_PenaltyГруппировка КАК ВТ_PenaltyГруппировка
		|ГДЕ
		|	ВТ_PenaltyГруппировка.PaymentDate <> ДАТАВРЕМЯ(1, 1, 1)
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_PenaltyГруппировка.Invoice) > 0";
	
	Запрос.УстановитьПараметр("ПериодКонец", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ПериодНачало", Период.ДатаНачала);
	
	
	
	Если ParentClient.Количество() > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеParentКлиент", "И ИерархияКонтрагентовСрезПоследних.ГоловнойКонтрагент В (&ParentClient)");
		Запрос.УстановитьПараметр("ParentClient",ParentClient);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеParentКлиент", "");
	КонецЕсли;
	Если Client.Количество() > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеКлиент", "И Penalties.Client В (&Client)");
		Запрос.УстановитьПараметр("Client",Client);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеКлиент", "");
	КонецЕсли;
	Если Contract.Количество() > 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеКонтракт", "И Penalties.Contract В (&Contract)");
		Запрос.УстановитьПараметр("Contract",Contract);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"&УсловиеКонтракт", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка_Outstanding = РезультатЗапроса[1].Выбрать();
	
	Пока Выборка_Outstanding.Следующий() Цикл
		OutstandingInvoice = Выборка_Outstanding.КоличествоInvoice;
		OutstandingBilledAR = Выборка_Outstanding.BaseAmountОстаток;
	КонецЦикла;
	
	Выборка_PaidOnTime = РезультатЗапроса[2].Выбрать();
	
	Пока Выборка_PaidOnTime.Следующий() Цикл
		InvoicePaidOnTime = Выборка_PaidOnTime.КоличествоInvoice;
		InvoicePaidOnTimeValue = Выборка_PaidOnTime.BaseAmountUSD;
	КонецЦикла;
	
	Выборка_Benefit = РезультатЗапроса[4].Выбрать();
	
	Пока Выборка_Benefit.Следующий() Цикл
		InvoicePaidEarly = Выборка_Benefit.КоличествоInvoice;
		InvoicePaidEarlyValue = Выборка_Benefit.BaseAmountUSD;
		ValueOfEarlyPayments = Выборка_Benefit.USDAmount;
	КонецЦикла;
	
	Выборка_Penalty_Overdue = РезультатЗапроса[6].Выбрать();
	Penatlies_Overdue = 0;
	
	Пока Выборка_Penalty_Overdue.Следующий() Цикл
		OverdueInvoice = Выборка_Penalty_Overdue.КоличествоInvoice;
		OverdueInvoiceValue = Выборка_Penalty_Overdue.BaseAmountUSD;
		Penatlies_Overdue = Выборка_Penalty_Overdue.USDAmount;
	КонецЦикла;
	
	Выборка_Penalty_PaidLate = РезультатЗапроса[7].Выбрать();
	Penatlies_PaidLate = 0;
	
	Пока Выборка_Penalty_PaidLate.Следующий() Цикл
		InvoicesPaidLate = Выборка_Penalty_PaidLate.КоличествоInvoice;
		InvoicesPaidLateValue = Выборка_Penalty_PaidLate.BaseAmountUSD;
		Penatlies_PaidLate = Выборка_Penalty_PaidLate.USDAmount;
	КонецЦикла;
	
	Penatlies = Penatlies_Overdue + Penatlies_PaidLate;
	
	NetLossGain = ValueOfEarlyPayments - Penatlies;
	
	InvoiceBilled = InvoicePaidEarly + InvoicesPaidLate + InvoicePaidOnTime + OverdueInvoice;
	AmountBilled = InvoicePaidEarlyValue + InvoicesPaidLateValue + InvoicePaidOnTimeValue + OverdueInvoiceValue;
	
КонецПроцедуры

&НаКлиенте
Процедура Расчитать(Команда)
	РасчитатьНаСервере();
КонецПроцедуры
